export const mockAnnouncementsData = [
  {
    id: 1,
    content: '数学の課題が更新されました。詳細はLMSをご確認ください。',
    created_at: '2024-01-01T00:00:00+09:00',
    updated_at: '2024-01-01T00:00:00+09:00'
  },
  {
    id: 2,
    content: '明日の授業はオンラインで行います。ZoomのリンクはLMSに掲載しています。',
    created_at: '2024-01-01T00:00:00+09:00',
    updated_at: '2024-01-01T00:00:00+09:00'
  },
  {
    id: 3,
    content: '来週の金曜日は休講となります。振替授業の詳細は後日お知らせします。',
    created_at: '2024-01-01T00:00:00+09:00',
    updated_at: '2024-01-01T00:00:00+09:00'
  },
  {
    id: 4,
    content: '期末試験の範囲が決まりました。詳細はLMSをご確認ください。',
    created_at: '2024-01-01T00:00:00+09:00',
    updated_at: '2024-01-01T00:00:00+09:00'
  },
  {
    id: 5,
    content: '課題の提出期限が来週の月曜日に延長しました。',
    created_at: '2024-01-01T00:00:00+09:00',
    updated_at: '2024-01-01T00:00:00+09:00'
  }
]
